Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: In particular, for an C<eval BLOCK> statement, $filename is C<(eval)>, but $evaltext is undefined.
es_es: En particular, para una sentencia C<eval BLOQUE>, $fichero es C<(eval)>, pero $evaltext es indefinido.

source: (Note also that each C<use> statement creates a C<require> frame inside an C<eval EXPR> frame.) $subroutine may also be C<(unknown)> if this particular subroutine happens to have been deleted from the symbol table.
es_es: (Note también que cada sentencia C<use> crea un marco C<require> dentro de un marco C<eval EXPR>). $subrutina puede ser también C<(unknown)> (desconocida) si esta subrutina en particular parece haber sido borrada de la tabla de símbolos.

source: C<$hasargs> is true if a new instance of C<@_> was set up for the frame.
es_es: C<$hasargs> es verdadero si una nueva instancia de C<@_> fue creada para este marco.

source: C<$hints> and C<$bitmask> contain pragmatic hints that the caller was compiled with.
es_es: C<$hints> y C<$bitmask> contienen detalles para los cuales caller fue compilado.

source: The C<$hints> and C<$bitmask> values are subject to change between versions of Perl, and are not meant for external use.
es_es: Los valores C<$hints> y C<$bitmask> están sujetos a cambios entre versiones de Perl y no se espera que sean utilizados para uso externo.

source: Furthermore, when called from within the DB package, caller returns more detailed information: it sets the list variable C<@DB::args> to be the arguments with which the subroutine was invoked.
es_es: Además, cuando se le llama desde el interior de un paquete DB, caller devuelve información más detallada: actuliza la variable C<@DB::args> con los argumentos con los que la subrutina fue invocada.

source: Be aware that the optimizer might have optimized call frames away before C<caller> had a chance to get the information.
es_es: Cuidado con el optimizador, que puede optimizar marcos de llamada antes de que C<caller> tenga la oportunidad de obtener la información.

source: That means that C<caller(N)> might not return information about the call frame you expect it do, for C<< N > 1 >>.
es_es: Esto significa que C<caller(N)> quizás no devuelva información sobre el marco de llamada que espera, para C<< N > 1 >>.

source: In particular, C<@DB::args> might have information from the previous time C<caller> was called.
es_es: En particular, C<@DB::args> podría tener información de la llamada a la anterior llamada a C<caller>.

source: =item chdir FILEHANDLE
es_es: =item chdir MANEJADOR

source: =item chdir DIRHANDLE
es_es: =item chdir MANEJADORDIR

source: Changes the working directory to EXPR, if possible.
es_es: Cambia el directorio de trabajo a EXPR, si es posible.

source: If EXPR is omitted, changes to the directory specified by C<$ENV{HOME}>, if set; if not, changes to the directory specified by C<$ENV{LOGDIR}>.
es_es: Si se omite EXPR, cambia al directorio especificado por C<$ENV{HOME}>, si está puesto; si no, cambia al directorio especificado por C<$ENV{LOGDIR}>.

source: (Under VMS, the variable C<$ENV{SYS$LOGIN}> is also checked, and used if it is set.) If neither is set, C<chdir> does nothing.
es_es: (Bajo VMS, la variable C<$ENV{SYS$LOGIN}> es también comprobada y usada si está puesta). Si ninguna está puesta, C<chdir> no hace nada.

source: It returns true upon success, false otherwise.
es_es: Devuelve verdadero si tuvo éxito, sino, falso.

source: See the example under C<die>.
es_es: Ver ejemplo en C<die>.

source: On systems that support fchdir, you might pass a file handle or directory handle as argument.
es_es: En sistemas que soportan fchdir, podría pasarle como argumento un manejador de fichero o un manejador de directorio.

source: On systems that don't support fchdir, passing handles produces a fatal error at run time.
es_es: En sistemas que no soportan fchdir, pasarle manejadores produce un error fatal en tiempo de ejecución.

source: =item chmod LIST X<chmod> X<permission> X<mode>
es_es: =item chmod LISTA X<chmod> X<permisos> X<modo>

source: Changes the permissions of a list of files.
es_es: Cambia los permisos de una lista de ficheros.

source: The first element of the list must be the numerical mode, which should probably be an octal number, and which definitely should I<not> be a string of octal digits: C<0644> is okay, C<'0644'> is not.
es_es: El primer elemento de la lista debe ser un modo numérico, que normalmente estará en octal, y que, definitivamente, I<no> debe ser una cadena de dígitos en octal: C<0644> es correcto, C<'0644'> no lo es.

source: Returns the number of files successfully changed.
es_es: Devuelve el número de ficheros cambiados con éxito.

source: See also L</oct>, if all you have is a string.
es_es: Ver también L</oct>, si todo lo que tiene es una cadena.

source: $cnt = chmod 0755, 'foo', 'bar';
es_es: $num = chmod 0755, 'foo', 'bar';

source: chmod 0755, @executables;
es_es: chmod 0755, @ejecutables;

source: $mode = '0644'; chmod $mode, 'foo'; # !!!
es_es: $modo = '0644'; chmod $modo, 'foo'; # !!!

source: sets mode to
es_es: pone el modo a

source: $mode = '0644'; chmod oct($mode), 'foo'; # this is better
es_es: $modo = '0644'; chmod oct($modo), 'foo'; # esto es mejor

source: $mode = 0644; chmod $mode, 'foo'; # this is best
es_es: $modo = 0644; chmod $modo, 'foo'; # este es el mejor

source: On systems that support fchmod, you might pass file handles among the files.
es_es: En sistemas que soportan fchmod, podría pasar manejadores de fichero en lugar de los ficheros.

source: On systems that don't support fchmod, passing file handles produces a fatal error at run time.
es_es: En sistemas que no soportan fchmod, pasarle manejadores produce un error fatal en tiempo de ejecución.

source: my $perm = (stat $fh)[2] & 07777;
es_es: my $permisos = (stat $fh)[2] & 07777;

source: chmod($perm | 0600, $fh);
es_es: chmod($permisos | 0600, $fh);

source: You can also import the symbolic C<S_I*> constants from the Fcntl module:
es_es: También puede importar las constantes simbólicas C<S_I*> desde el módulo Fcntl:

source: chmod S_IRWXU|S_IRGRP|S_IXGRP|S_IROTH|S_IXOTH, @executables;
es_es: chmod S_IRWXU|S_IRGRP|S_IXGRP|S_IROTH|S_IXOTH, @ejecutables;

source: # This is identical to the chmod 0755 of the above example.
es_es: # Esto es idéntico a chmod 0755 del ejemplo de arriba.

source: =item chomp VARIABLE X<chomp> X<INPUT_RECORD_SEPARATOR> X<$/> X<newline> X<eol>
es_es: =item chomp VARIABLE X<chomp> X<INPUT_RECORD_SEPARATOR> X<$/> X<newline> X<eol> X<nueva línea> X<fin de línea>

source: =item chomp( LIST )
es_es: =item chomp( LISTA )

source: This safer version of L</chop> removes any trailing string that corresponds to the current value of C<$/> (also known as $INPUT_RECORD_SEPARATOR in the C<English> module).
es_es: Esta es la versión segura de L</chop>, que quita cualquier string restante que corresponda al valor actual de C<$/> (también conocido como $INPUT_RECORD_SEPARATOR -separador de registros en entrada- en el módulo C<English>).

source: It returns the total number of characters removed from all its arguments.
es_es: Devuelve el número total de caracteres eliminados de todos sus argumentos.

source: It's often used to remove the newline from the end of an input record when you're worried that the final record may be missing its newline.
es_es: Se utiliza a menudo para eliminar el carácter de nueva línea del final de un registro de entrada cuando es importante que el registro al final le pueda faltar ese carácter.

source: When in paragraph mode (C<$/ = "">), it removes all trailing newlines from the string.
es_es: En modo párrafo (C<$/ = "">), elimina todos los caracteres de nueva línea del string.

source: When in slurp mode (C<$/ = undef>) or fixed-length record mode (C<$/> is a reference to an integer or the like, see L<perlvar>) chomp() won't remove anything.
es_es: En modo chupón (C<$/ = undef>) o en modo registros de longitud fija (C<$/> es una referencia a un entero o algo parecido, ver L<perlvar>) chomp() no elimina nada.

source: If VARIABLE is omitted, it chomps C<$_>.
es_es: Si VARIABLE se omite, usa C<$_>.

# while (<>) { chomp; # avoid on last field @array = split(/:/); # ...
source: while (<>) { chomp; # avoid \n on last field @array = split(/:/); # ...
es_es: while (<>) { chomp; # evitar \n en el último campo @array = split(/:/); # ...

source: If VARIABLE is a hash, it chomps the hash's values, but not its keys.
es_es: Si VARIABLE es un hash, recorta los valores del hash, pero no sus claves.

source: You can actually chomp anything that's an lvalue, including an assignment:
es_es: Puede recortar cualquier cosa que sea un lvalue (valor a la izquierda), incluyendo una asignación:

source: chomp($answer = <STDIN>);
es_es: chomp($respuesta = <STDIN>);

source: If you chomp a list, each element is chomped, and the total number of characters removed is returned.
es_es: Si recorta una lista, cada elemento es recortado y se devuelve el número total de caracteres eliminados.

source: If the C<encoding> pragma is in scope then the lengths returned are calculated from the length of C<$/> in Unicode characters, which is not always the same as the length of C<$/> in the native encoding.
es_es: Si el pragma C<encoding> está en el ámbito actual entonces la longitud devuelta es calculada a partir de la longitud de los caracteres C<$/> Unicode, que no siempre es de la longitud de C<$/> en la codificación nativa.

source: Note that parentheses are necessary when you're chomping anything that is not a simple variable.
es_es: Nota que los paréntesis son necesarios cuando esté recortando cualquier cosa que no sea una simple variable.

source: This is because C<chomp $cwd = `pwd`;> is interpreted as C<(chomp $cwd) = `pwd`;>, rather than as C<chomp( $cwd = `pwd` )> which you might expect.
es_es: Esto es porque C<chomp $cwd = `pwd`;> es interpretado como C<(chomp $cwd) = `pwd`;>, en vez de un C<chomp( $cwd = `pwd` )> que es lo que se esperaba.

source: Similarly, C<chomp $a, $b> is interpreted as C<chomp($a), $b> rather than as C<chomp($a, $b)>.
es_es: Similarmente, C<chomp $a, $b> es interpretado como C<chomp($a), $b> en vez de un C<chomp($a, $b)>.

source: =item chop( LIST )
es_es: =item chop( LISTA )

source: Chops off the last character of a string and returns the character chopped.
es_es: Recorta el último carácter de un string y devuelve el carácter recortado.

source: It is much more efficient than C<s/.$//s> because it neither scans nor copies the string.
es_es: Es más eficiente que C<s/.$//s> porque ni escanea ni copia el string.

source: If VARIABLE is omitted, chops C<$_>.
es_es: Si VARIABLE se omite, recorta C<$_>.

source: If VARIABLE is a hash, it chops the hash's values, but not its keys.
es_es: Si VARIABLE es un hash, recorta los valores del hash, pero no sus claves.

source: You can actually chop anything that's an lvalue, including an assignment.
es_es: Puede recortar cualquier cosa que sea un lvalue (valor a la izquierda), incluyendo una asignación.

source: If you chop a list, each element is chopped.
es_es: Si recorta una lista, cada elemento es recortado.

source: Only the value of the last C<chop> is returned.
es_es: Sólo se devuelve el valor del último recorte.

source: Note that C<chop> returns the last character.
es_es: Note que C<chop> devuelve el último carácter.

source: To return all but the last character, use C<substr($string, 0, -1)>.
es_es: Para devolver todos menos el último carácter, use C<substr($string, 0, -1)>.

source: See also L</chomp>.
es_es: Ver también L</chomp>.

source: =item chown LIST X<chown> X<owner> X<user> X<group>
es_es: =item chown LISTA X<chown> X<owner> X<user> X<group> X<propietario> X<usuario> X<grupo>

source: Changes the owner (and group) of a list of files.
es_es: Cambia el propietario (y grupo) de una lista de ficheros.

source: The first two elements of the list must be the I<numeric> uid and gid, in that order.
es_es: Los primeros dos elementos de la lista deben ser el valor I<numérico> del uid y gid, en este orden.

source: A value of -1 in either position is interpreted by most systems to leave that value unchanged.
es_es: Un valor de -1 en cualquier posición es interpretado en la mayoría de los sistemas como que se deja el actual valor sin cambiar.

source: $cnt = chown $uid, $gid, 'foo', 'bar';
es_es: $num = chown $uid, $gid, 'foo', 'bar';

source: chown $uid, $gid, @filenames;
es_es: chown $uid, $gid, @ficheros;

source: On systems that support fchown, you might pass file handles among the files.
es_es: En sistemas que soportan fchown, podría pasar manejadores de fichero en lugar de los ficheros.

source: On systems that don't support fchown, passing file handles produces a fatal error at run time.
es_es: En sistemas que no soportan fchown, pasarle manejadores produce un error fatal en tiempo de ejecución.

source: Here's an example that looks up nonnumeric uids in the passwd file:
es_es: Aquí hay un ejemplo que obtiene el uid numérico a partir del fichero de contraseñas:

source: print "User: ";
es_es: print "Usuario: ";

source: chomp($user = <STDIN>);
es_es: chomp($usuario = <STDIN>);

source: print "Files: ";
es_es: print "Ficheros: ";

source: chomp($pattern = <STDIN>);
es_es: chomp($patron = <STDIN>);

source: ($login,$pass,$uid,$gid) = getpwnam($user) or die "$user not in passwd file";
es_es: ($login,$pass,$uid,$gid) = getpwnam($usuario) or die "$usuario no está en fichero de contraseñas";

source: @ary = glob($pattern); # expand filenames
es_es: @ary = glob($patron); # expande los nombres de fichero

source: On most systems, you are not allowed to change the ownership of the file unless you're the superuser, although you should be able to change the group to any of your secondary groups.
es_es: En la mayoría de los sistemas, no se le permite cambiar la propiedad del fichero a menos que sea el superusuario, aunque sí pueda cambiar el grupo a cualquiera de sus grupos secundarios.

source: On insecure systems, these restrictions may be relaxed, but this is not a portable assumption.
es_es: En sistemas inseguros, estas restricciones pueden estar más relajadas, pero no es una suposición normal.

source: On POSIX systems, you can detect this condition this way:
es_es: En sistemas POSIX, puede detectar esta condición de esta manera:

source: $can_chown_giveaway = not sysconf(_PC_CHOWN_RESTRICTED);
es_es: $puedo_hacer_chown = not sysconf(_PC_CHOWN_RESTRICTED);

source: =item chr NUMBER X<chr> X<character> X<ASCII> X<Unicode>
es_es: =item chr NÚMERO X<chr> X<character> X<ASCII> X<Unicode> X<carácter>

source: Returns the character represented by that NUMBER in the character set.
es_es: Devuelve el carácter representado por NÚMERO en el conjunto de caracteres.

source: For example, C<chr(65)> is C<"A"> in either ASCII or Unicode, and chr(0x263a) is a Unicode smiley face.
es_es: Por ejemplo, C<chr(65)> es C<"A"> tanto en ASCII como en Unicode, y chr(0x263a) es una cara sonriente en Unicode.

source: Note that characters from 128 to 255 (inclusive) are by default not encoded in UTF-8 Unicode for backward compatibility reasons (but see L<encoding>).
es_es: Nota que los caracteres del 128 al 255 (inclusive) no están codificados por defecto en Unicode UTF-8 por razones de compatibilidad hacia atrás (pero vea L<encoding>).

source: If NUMBER is omitted, uses C<$_>.
es_es: Si se omite NÚMERO, se usa C<$_>.

source: For the reverse, use L</ord>.
es_es: Para lo contrario, use L</ord>.

source: Note that under the C<bytes> pragma the NUMBER is masked to the low eight bits.
es_es: Note que bajo el pragma C<bytes> el NÚMERO es enmascarado a los 8 bits más bajos.

source: See L<perlunicode> and L<encoding> for more about Unicode.
es_es: Ver L<perlunicode> y L<encoding> para más información sobre Unicode.

source: =item chroot FILENAME X<chroot> X<root>
es_es: =item chroot FICHERO X<chroot> X<root>

source: This function works like the system call by the same name: it makes the named directory the new root directory for all further pathnames that begin with a C</> by your process and all its children.
es_es: Esta funcion trabaja como la llamada del sistema del mismo nombre: hace que el directorio indicado sea el directorio raíz de los siguientes caminos que comiencen por un C</> en su proceso y todos sus hijos.

source: (It doesn't change your current working directory, which is unaffected.) For security reasons, this call is restricted to the superuser.
es_es: (No cambia su actual directorio de trabajo actual, que no queda afectado). Por razones de seguridad, esta llamada está reservada al superusuario.

source: If FILENAME is omitted, does a C<chroot> to C<$_>.
es_es: Si FICHERO se omite, hace un C<chroot> a C<$_>.

source: =item close FILEHANDLE X<close>
es_es: =item close MANEJADOR X<close>

source: Closes the file or pipe associated with the file handle, returning true only if IO buffers are successfully flushed and closes the system file descriptor.
es_es: Cierra el fichero o tubería asociada con el manejador, devolviendo verdadero sólo si la memoria intermedia de IO (E/S) se han podido despejar y se ha cerrado el descriptor de archivo del sistema.

source: Closes the currently selected filehandle if the argument is omitted.
es_es: Cierra el manejador actualmente seleccionado si se omite el argumento.

source: You don't have to close FILEHANDLE if you are immediately going to do another C<open> on it, because C<open> will close it for you.
es_es: No tiene porqué cerrar el MANEJADOR si inmediatamente va a hacer otro C<open> sobre él mismo, porque C<open> le cerrará por usted.

source: (See C<open>.) However, an explicit C<close> on an input file resets the line counter (C<$.>), while the implicit close done by C<open> does not.
es_es: (Ver C<open>). Sin embargo, un C<close> explícito en un fichero de entrada reiniza el contador de líneas (C<$.>), mientras que un C<close> implícito hecho por C<open>, no.

source: If the file handle came from a piped open, C<close> will additionally return false if one of the other system calls involved fails, or if the program exits with non-zero status.
es_es: Si el manejador proviene de una tubería abierta, C<close> adicionalmente devolverá falso si alguna de las otras llamadas del sistema implicadas falla, o si el programa sale con un valor de estado de no cero.

source: (If the only problem was that the program exited non-zero, C<$!> will be set to C<0>.) Closing a pipe also waits for the process executing on the pipe to complete, in case you want to look at the output of the pipe afterwards, and implicitly puts the exit status value of that command into C<$?>.
es_es: (Si el único problema fue que el programa salió con un valor no cero, C<$!> será puesto a C<0>). Cerrar una tubería implica esperar a que el proceso que ejecuta la tubería termine, para el caso de que quiera obtener después la salida de la tubería, e implícitamente pone el valor del estado de salida del comando en C<$?>.

source: Prematurely closing the read end of a pipe (i.e. before the process writing to it at the other end has closed it) will result in a SIGPIPE being delivered to the writer.
es_es: Cerrar prematuramente la lectura final de una tubería (p.e. antes de que el proceso de escritura a él desde el otro lado se haya cerrado) resultará en un SIGPIPE enviado al escritor.

source: If the other end can't handle that, be sure to read all the data before closing the pipe.
es_es: Si el otro lado no puede manejar esto, asegúrese de leer todos los datos antes de cerrar la tubería.

source: open(OUTPUT, '|sort >foo') # pipe to sort
es_es: open(OUTPUT, '|sort >foo') # tubería a sort

source: or die "Can't start sort: $!";
es_es: or die "No puedo iniciar sort: $!";

source: #... # print stuff to output
es_es: #... # pintar material a la salida

source: close OUTPUT # wait for sort to finish
es_es: close OUTPUT # esperar a que termine sort

source: "Error closing sort pipe: $!"
es_es: "Error cerrando tubería sort: $!"

source: : "Exit status $?
es_es: : "Estatus de salida $?

source: from sort";
es_es: desde sort";

source: open(INPUT, 'foo') # get sort's results
es_es: open(INPUT, 'foo') # obtener el resultado de sort

source: or die "Can't open 'foo' for input: $!";
es_es: or die "No puedo abrir 'foo' para entrada: $!";

source: FILEHANDLE may be an expression whose value can be used as an indirect filehandle, usually the real filehandle name.
es_es: MANEJADOR puede ser una expresión cuyo valor puede ser usado como un manejador indirecto, normalmente el nombre real del manejador.

source: =item closedir DIRHANDLE X<closedir>
es_es: =item closedir MANEJADORDIR X<closedir>

source: Closes a directory opened by C<opendir> and returns the success of that system call.
es_es: Cierra un directorio abierto por C<opendir> y devuelve el éxito de la llamada del sistema.

source: =item connect SOCKET,NAME X<connect>
es_es: =item connect SOCKET,NOMBRE X<connect>

source: Attempts to connect to a remote socket, just as the connect system call does.
es_es: Intenta conectarse a un socket remoto, como lo hace la llamada del sistema connect.

source: =item continue BLOCK X<continue>
es_es: =item continue BLOQUE X<continue>

source: C<continue> is actually a flow control statement rather than a function.
es_es: C<continue> es realmente una sentencia de control de flujo en lugar de una función.

source: If there is a C<continue> BLOCK attached to a BLOCK (typically in a C<while> or C<foreach>), it is always executed just before the conditional is about to be evaluated again, just like the third part of a C<for> loop in C.
es_es: Si existe un BLOQUE C<continue> adjunto a un BLOQUE (típicamente en un C<while> o C<foreach>), siempre es ejecutado justo antes de que la condicional sea de nuevo evaluada, igual que la tercera parte de un bucle C<for> en C.

source: Thus it can be used to increment a loop variable, even when the loop has been continued via the C<next> statement (which is similar to the C C<continue> statement).
es_es: Así, puede ser usado para incrementar una variable de bucle, incluso cuando el bucle ha sido interrumpido por medio de una sentencia C<next> (por lo que es similar a la sentencia C<continue> del C).

source: C<last>, C<next>, or C<redo> may appear within a C<continue> block.
es_es: C<last>, C<next> o C<redo> pueden aparecer dentro de un bloque C<continue>.

source: C<last> and C<redo> will behave as if they had been executed within the main block.
es_es: C<last> y C<redo> se comportarán como si se hubieran ejecutado dentro del bloque principal.

source: So will C<next>, but since it will execute a C<continue> block, it may be more entertaining.
es_es: También C<next>, pero como el ejecutará un bloque C<continue>, será algo más divertido.

source: while (EXPR) { ### redo always comes here do_something;
es_es: while (EXPR) { ### redo siempre viene aquí hacer_algo;

source: } continue { ### next always comes here do_something_else; # then back the top to re-check EXPR
es_es: } continue { ### next siempre viene aquí hacer_algo_despues; # entonces regresa arriba a recomprobar la EXPR

source: ### last always comes here
es_es: ### last siempre viene aquí

source: Omitting the C<continue> section is semantically equivalent to using an empty one, logically enough.
es_es: Omitiendo la sección C<continue> es semánticamente equivalente a usar uno vacío, lo cual es lógico.

source: In that case, C<next> goes directly back to check the condition at the top of the loop.
es_es: En este caso, C<next> sube directamente a comprobar la condición al principio del bucle.

source: =item cos EXPR X<cos> X<cosine> X<acos> X<arccosine>
es_es: =item cos EXPR X<cos> X<cosine> X<acos> X<arccosine> X<coseno> X<arcocoseno>
